In [18]:
import pandas as pd
data = [[1, 100], [2, 200]]
products = pd.DataFrame(data, columns=['product_id', 'price']).astype({'product_id':'Int64', 'price':'Int64'})
display(products)
data = [[1, 1, 2], [3, 2, 1], [2, 2, 3], [2, 1, 4], [4, 1, 10]]
purchases = pd.DataFrame(data, columns=['invoice_id', 'product_id', 'quantity']).astype({'invoice_id':'Int64', 'product_id':'Int64', 'quantity':'Int64'})
display(purchases)

   product_id  price
0           1    100
1           2    200

   invoice_id  product_id  quantity
0           1           1         2
1           3           2         1
2           2           2         3
3           2           1         4
4           4           1        10

In [19]:
purchases = purchases.merge(products, how='left', on='product_id')
purchases = purchases.rename(columns={"price": "product_price"})
purchases["price"] = purchases["product_price"] * purchases["quantity"]

df = purchases.groupby(['invoice_id'])[["price"]].sum().reset_index()
df = df.sort_values(by=["price", "invoice_id"], ascending=[False, True])

highest_invoice = df["invoice_id"].values[0]

purchases = purchases[purchases["invoice_id"] == highest_invoice]
purchases = purchases.drop(columns=["invoice_id", "product_price"])
display(purchases)

   product_id  quantity  price
2           2         3    600
3           1         4    400